avrxml/AS6-Devices-XML/ATSAM3SD8C.xml
<?xml version="1.0" encoding="UTF-8"?><!-- ============================================================================ --><!--                  Atmel Microcontroller Software Support                      --><!-- ============================================================================ --><!-- Copyright (c) 2012, Atmel Corporation                                        --><!--                                                                              --><!-- All rights reserved.                                                         --><!--                                                                              --><!-- Redistribution and use in source and binary forms, with or without           --><!-- modification, are permitted provided that the following condition is met:    --><!--                                                                              --><!-- - Redistributions of source code must retain the above copyright notice,     --><!-- this list of conditions and the disclaimer below.                            --><!--                                                                              --><!-- Atmel's name may not be used to endorse or promote products derived from     --><!-- this software without specific prior written permission.                     --><!--                                                                              --><!-- DISCLAIMER: THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR    --><!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF --><!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   --><!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      --><!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT --><!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  --><!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    --><!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         --><!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, --><!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           --><!-- ============================================================================ --><avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATSAM3SD8C-CU" package="BGA100" speedmax="+0" tempmax="+0" tempmin="+0" vccmax="+0" vccmin="+0"/>
    <variant ordercode="ATSAM3SD8C-AU" package="LQFP100" speedmax="+0" tempmax="+0" tempmin="+0" vccmax="+0" vccmin="+0"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M3" family="SAM3" name="ATSAM3SD8C" series="SAM3SD8">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="IFLASH0" start="0x00400000" size="0x00040000" type="flash" pagesize="256"/>
          <memory-segment name="IROM" start="0x00800000" size="0x00400000" type="other"/>
          <memory-segment name="IFLASH1" start="0x00C00000" size="0x00040000" type="flash" pagesize="256"/>
          <memory-segment name="IRAM" start="0x20000000" size="0x00010000" type="ram"/>
          <memory-segment name="EBI_CS0" start="0x60000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS1" start="0x61000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS2" start="0x62000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS3" start="0x63000000" size="0x01000000" type="other"/>
        <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x20000000" type="io"/>  
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="1" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="1" start="0"/>
      </address-spaces>
      <peripherals>
        <module name="ACC" id="ACC" version="6490C">
          <instance name="ACC">
            <register-group address-space="base" name="ACC" name-in-module="ACC" offset="0x40040000"/>
          </instance>
        </module>
        <module name="ADC" id="ADC" version="6489I">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0x40038000"/>
            <signals>
              <signal pad="PA8" function="B" group="ADTRG"/>
              <signal pad="PA17" function="X1" group="AD" index="0"/>
              <signal pad="PA18" function="X1" group="AD" index="1"/>
              <signal pad="PA19" function="X1" group="AD" index="2"/>
              <signal pad="PA19" function="X1" group="WKUP" index="9"/>
              <signal pad="PA20" function="X1" group="AD" index="3"/>
              <signal pad="PA20" function="X1" group="WKUP" index="10"/>
              <signal pad="PB0" function="X1" group="AD" index="4"/>
              <signal pad="PB0" function="X1" group="RTCOUT" index="0"/>
              <signal pad="PB1" function="X1" group="AD" index="5"/>
              <signal pad="PB1" function="X1" group="RTCOUT" index="1"/>
              <signal pad="PB2" function="X1" group="AD" index="6"/>
              <signal pad="PB2" function="X1" group="WKUP" index="12"/>
              <signal pad="PB3" function="X1" group="AD" index="7"/>
              <signal pad="PA21" function="X1" group="AD" index="8"/>
              <signal pad="PA22" function="X1" group="AD" index="9"/>
              <signal pad="PC13" function="X1" group="AD" index="10"/>
              <signal pad="PC15" function="X1" group="AD" index="11"/>
              <signal pad="PC12" function="X1" group="AD" index="12"/>
              <signal pad="PC29" function="X1" group="AD" index="13"/>
              <signal pad="PC30" function="X1" group="AD" index="14"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" id="CHIPID" version="6417K">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0740"/>
